Noninapizzicas/3enki/modules/esp32-dev/templates/esp32-p4-cocina/sdkconfig.defaults
# ESP32-P4 Pantalla Cocina — SDK Configuration

# Board
CONFIG_IDF_TARGET="esp32p4"

# WiFi
CONFIG_ESP_WIFI_SSID_LEN_MAX=32
CONFIG_ESP_WIFI_PASSWORD_LEN_MAX=64

# Networking
CONFIG_ESP_NETIF_BRIDGE_EN=y
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_BUFFER_SIZE=2048

# NVS
CONFIG_NVS_ENCRYPTION=n

# Disable TLS/HTTPS for now to avoid mbedtls compilation issues
CONFIG_ESP_HTTPS_OTA_SKIP_COMMON_NAME_CHECK=y
CONFIG_MBEDTLS_TLS_ENABLED=n
CONFIG_MBEDTLS_SSL_TRUNCATED_HMAC=n

# LVGL
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_TICK_CUSTOM=y
CONFIG_LV_TICK_CUSTOM_INCLUDE="lv_conf.h"

# Display
CONFIG_ESP_LCD_ENABLE=y

# FreeRTOS
CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL=INFO
CONFIG_LOG_MAXIMUM_LEVEL=DEBUG

# Main stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# Watchdog
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y

# OTA (disabled for now due to TLS build issues)
CONFIG_APP_ROLLBACK_ENABLE=n
CONFIG_APP_SECURE_BOOT_ENABLED=n
CONFIG_ESP_HTTPS_OTA_ENABLED=n

# Memory
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=n
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072

# Event loop
CONFIG_ESP_EVENT_LOOP_STACK_SIZE=4096

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=n
